[
    {
        "id": "592c4c91-84c5-4273-9a24-eb155e53e43a",
        "cover": "https://images.unsplash.com/photo-1566416548759-caf7a5ef3c57",
        "notion_url": "https://www.notion.so/What-are-the-benefits-of-providing-text-alternatives-for-non-text-content-592c4c9184c542739a24eb155e53e43a",
        "icon": "🈂️",
        "edited": "2023-01-31T21:04:00.000Z",
        "created": "2023-01-31T13:14:00.000Z",
        "description": "Everyone should have equal access to content online. Text alternatives help make this a reality by ensuring everyone can understand and interact with digital content, regardless of their ability.",
        "references": [
            {
                "citation": "Thomas Byttebier, 2015",
                "url": "https://thomasbyttebier.be/blog/the-best-icon-is-a-text-label",
                "name": "The best icon is a text label"
            },
            {
                "citation": "W3C, Web Content Accessibility Guidelines 2.0",
                "url": "https://www.w3.org/TR/WCAG20/#text-equiv",
                "name": "Web Content Accessibility Guidelines (WCAG) 2.0"
            },
            {
                "citation": "Zoltan Kollin, Medium, 2015",
                "url": "https://medium.com/@kollinz/misused-mobile-ux-patterns-84d2b6930570",
                "name": "Misused mobile UX patterns. If you are an experienced designer, you… "
            },
            {
                "citation": "Voice+Code, 2019",
                "url": "https://www.voiceandcode.com/our-insights/2019/6/7/ux-best-practices-include-labels-with-icons",
                "name": "UX Best Practices: Include Labels with Icons"
            }
        ],
        "category": {
            "id": "f10c352a-57f6-4935-941f-c99dbfaee854",
            "name": "Accessibility",
            "color": "pink"
        },
        "slugs": "provide-alt-text",
        "name": "What are the benefits of providing text alternatives for non-text content?",
        "markdownContent": "\nIcons should only be used if their message is completely clear to everyone. Adding text labels can help to improve clarity.\n\n\n\n> ”Icons should be simple, easy to understand, and consistent. Icons almost always require familiarity in order to be useful. Across cultures and languages, they can be misinterpreted. In many cases, adjacent text is helpful. “(WebAim)\n\n"
    },
    {
        "id": "728073c2-84d0-43d5-8a44-03c7f479d72a",
        "cover": "https://images.unsplash.com/photo-1607434472257-d9f8e57a643d",
        "notion_url": "https://www.notion.so/How-long-can-users-wait-for-a-page-to-load-728073c284d043d58a4403c7f479d72a",
        "icon": "⏳",
        "edited": "2023-01-31T11:54:00.000Z",
        "created": "2022-07-21T23:10:00.000Z",
        "description": "Page load time is the time it takes to display all the content on a web page. In some cases, these load times can be significantly long and induce frustration to the end user. Studies have shown that are users are willing to wait between 2 to 10 seconds for a page to load.",
        "references": [
            {
                "citation": "Nah, F. F. H. (2004). \"A study on tolerable waiting time: how long are Web users willing to wait?\" ",
                "url": "https://www.researchgate.net/publication/240624333_A_study_on_tolerable_waiting_time_how_long_are_Web_users_willing_to_wait_Citation_Nah_F_2004_A_study_on_tolerable_waiting_time_how_long_are_Web_users_willing_to_wait_Behaviour_Information_Technology_f",
                "name": "A study on tolerable waiting time: how long are Web users willing to wait?"
            },
            {
                "citation": "Ramsay, J., Barbesi, A. and Preece, J., 1998, A psychological investigation of long retrieval times on the world wide web. Interacting with Computer",
                "url": "https://academic.oup.com/iwc/article-abstract/10/1/77/913206",
                "name": "A psychological investigation of long retrieval times on the World Wide Web"
            }
        ],
        "category": {
            "id": "00ceebbe-808b-48a4-b72c-306c38353336",
            "name": "Notifications",
            "color": "green"
        },
        "slugs": "how-long-users-can-wait",
        "name": "How long can users wait for a page to load?",
        "markdownContent": "\nPage load time is the time it takes to display all the content on a web page. In some cases, these load times can be significantly long and induce frustration to the end user. Studies have shown that are users are willing to wait between 2 to 10 seconds for a page to load.\n\n\n## Speed impacts how interesting websites are perceived\n\n\n### Faster websites are more appreciated\n\n\nWebsites that are slow often induce frustration, especially when there is only a blank screen to stare at. In fact, research has shown that faster web pages are perceived as more interesting than slower ones (Ramsay, Barbesi and Preece, 1998). \n\nIn a study, Nah found that the tolerable waiting time for a page to load was 2 seconds (Nah, 2004). At the time it also found that a page took on average about 10.3 seconds on a desktop computer and 27.3 seconds on a mobile phone. Thus concluding that your average website take more time to load than what we supposedly tolerate.\n\n\n### Slow load times\n\n\nThis suggests that loading times exceeding this 2 second threshold can have a negative impact on the user experience. And unfortunately, the reduction of load times often depends on factors that cannot be easily controlled (e.g. request of the server, large assets etc.). In such cases, Nah proposes a different solution to maintain a good user experience, namely feedback. \n\n\n## Solving long page load\n\n\nEvidence suggests that the availability of feedback extends the tolerable waiting time of web users. This is because it provides transparency into the hidden processes of the interface as well as an estimate of the waiting time. \nWhen presented with an estimation of an ongoing process, users are able to alleviate this wait time by engaging in other activities. Without a feedback users are left to guess at what point a process will conclude.\n\n\n## Key takeaways\n\n1. Faster pages are perceived as more interesting than slower pages.\n2. When loading feedback is provided, it reaches 10 seconds.\n3. Tolerable waiting time for a page to load is about 2 seconds.\n"
    },
    {
        "id": "af855c92-2a3b-45ce-b4ea-0a8156daf7b9",
        "cover": "https://images.unsplash.com/photo-1507146153580-69a1fe6d8aa1",
        "notion_url": "https://www.notion.so/Why-are-more-user-friendly-error-messages-important-af855c922a3b45ceb4ea0a8156daf7b9",
        "icon": "🤖",
        "edited": "2023-01-31T12:34:00.000Z",
        "created": "2022-07-21T23:07:00.000Z",
        "description": "When a user interacts with an interface in an unintended way, some errors may be generated. In these circumstances, the interface's response may fall somewhere between a \"friendly apology\" or a generic uninformative response. Are we more tolerant of a computer that apologizes?",
        "references": [
            {
                "citation": "Jeng-Yi Tzeng. 2004. Toward a more civilized design: studying the effects of computers that apologize. Int. J. Hum.-Comput. Stud. 61, 3 (September 2004), 319–345.",
                "url": "https://doi.org/10.1016/j.ijhcs.2004.01.002",
                "name": "Toward a more civilized design: studying the effects of computers that apologize"
            },
            {
                "citation": "B.J. Fogg, and C. Nass. “Silicon Sycophans: The Effects of Computers That Flatter.”International Journal of Human-Computer Studies",
                "url": "https://doi.org/10.1006/ijhc.1996.0104",
                "name": "Silicon sycophants: the effects of computers that flatter"
            },
            {
                "citation": "Jenni Nadler, Wix, 2022",
                "url": "https://wix-ux.com/when-life-gives-you-lemons-write-better-error-messages-46c5223e1a2f",
                "name": "When life gives you lemons, write better error messages"
            }
        ],
        "category": {
            "id": "00ceebbe-808b-48a4-b72c-306c38353336",
            "name": "Notifications",
            "color": "green"
        },
        "slugs": "when-computers-apologize",
        "name": "Why are more user-friendly error messages important?",
        "markdownContent": "\nWhen a user interacts with an interface in an unintended way, some errors may be generated. In these circumstances, the interface's response may fall somewhere between a \"friendly apology\" or a generic uninformative response. Are we more tolerant of a computer that apologizes?\n\n\n### Building an emotional interaction\n\n\nSome research has shown that users will spend more time interacting with a system that provides emotional responses than with a system that provides generic feedback. For example, Nass showed that users who received flattery from a computer thought the interaction was more pleasant than users who received generic feedback (Nass, 1997). Meanwhile, Tzeng found that apologetic responses gave users a better impression of the overall interaction with the system (Tzeng, 2004).\n\n\n## How to write better error messages\n\n\nAccording to WIX, a good error message explains what happened and why, provides reassurance, is empathetic, helps the user fix the issue and gives the user a way out.\n\n\n### Are users more tolerant of a computer that apologizes ?\n\n1. Flattering responses provide a more pleasant interaction than generic messages.\n2. Apologetic responses give users a better impression of the overall interaction.\n"
    }
]